Revit 2027 API
ParameterTypeId.CurveVisibilityParam Property
 "Visibility/Graphics Overrides"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurveVisibilityParam { get; }
Public Shared ReadOnly Property CurveVisibilityParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurveVisibilityParam {
	ForgeTypeId^ get ();
}
static member CurveVisibilityParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace